package by.epam.lab.training;

import java.util.Scanner;

import static java.lang.Integer.parseInt;

public class CyclesTaskOne {
    /*
    Basics_of_software_code_development

    1. Напишите программу, где пользователь вводит любое целое положительное число.
    А программа суммирует все числа от 1 до введенного пользователем числа.*/

    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {

            System.out.print("Input a positive integer number: ");
            int number = parseInt(scanner.nextLine());
            int result = 0;

        }
    }

}
